import React, { Component } from 'react';
import { Link } from 'react-router-dom'
import AgencyHeader from './AgencyHeader';
import AgencyFooter from './AgencyFooter';
import './services.css';

class Services extends Component {
    render() {
        let TripImg = {
            // backgroundImage: `url(${this.props.info.featuredImg.thumbnail})`,
            backgroundImage: `url(/img/heros/agency-about.jpg)`,
        };
        return (
            <div className="AgencyApp">
                <AgencyHeader />
                <div className="agency-services">
                    <div className="hero" style={TripImg}></div>
                    <div className="agency-info-services">
                        <h1>خدمات الشركة</h1>
                        <p>يقع الفندق  فى وسط مدينة بيروت على بعد 50 متر من شارع الحمرا الشهير ,الفندق رائع من حيث الموقع فهو قريب من اماكن التسوق, مركز بيروت للفن و على بعد 10 دقائق من مطار رفيق الحريرى  ,ويضم جمنازيوم مجهز تجهيزا جيدا، وساونا ومكتب الاستقبال يعمل على مدار 24 ساعة. كما يمكن للنزلاء الاستمتاع بالمأكولات اللبنانية الشهيرة في مطعم الفندق أو اكتشاف العديد من خيارات الطعام النموذجية ذات المستوى العالمي، على بعد خطوات من الفندق</p>
                    </div>
                    <div className="ser-list">
                        <div className="item">
                            <div className="pic">
                                <img src="/img/serv/01.jpg" alt="serv" />
                            </div>
                            <div className="text">
                                <h2>رحلات رخيصة، فنادق رائعة وعروض ممتازة</h2>
                                <p>يقع الفندق  فى وسط مدينة بيروت على بعد 50 متر من شارع الحمرا الشهير ,الفندق رائع من حيث الموقع فهو قريب من اماكن التسوق, مركز بيروت للفن و على بعد 10 دقائق من مطار رفيق الحريرى  ,ويضم جمنازيوم مجهز تجهيزا جيدا، وساونا ومكتب الاستقبال يعمل على مدار 24 ساعة. كما يمكن للنزلاء الاستمتاع بالمأكولات اللبنانية الشهيرة في مطعم الفندق أو اكتشاف العديد من خيارات الطعام النموذجية ذات المستوى العالمي، على بعد خطوات من الفندق يقع الفندق  </p>
                            </div>
                        </div>
                        <div className="item">
                            <div className="pic">
                                <img src="/img/serv/02.jpg" alt="serv" />
                            </div>
                            <div className="text">
                                <h2>رحلات رخيصة، فنادق رائعة وعروض ممتازة</h2>
                                <p>يقع الفندق  فى وسط مدينة بيروت على بعد 50 متر من شارع الحمرا الشهير ,الفندق رائع من حيث الموقع فهو قريب من اماكن التسوق, مركز بيروت للفن و على بعد 10 دقائق من مطار رفيق الحريرى  ,ويضم جمنازيوم مجهز تجهيزا جيدا، وساونا ومكتب الاستقبال يعمل على مدار 24 ساعة. كما يمكن للنزلاء الاستمتاع بالمأكولات اللبنانية الشهيرة في مطعم الفندق أو اكتشاف العديد من خيارات الطعام النموذجية ذات المستوى العالمي، على بعد خطوات من الفندق يقع الفندق  </p>
                            </div>
                        </div>
                        <div className="item">
                            <div className="pic">
                                <img src="/img/serv/03.jpg" alt="serv" />
                            </div>
                            <div className="text">
                                <h2>رحلات رخيصة، فنادق رائعة وعروض ممتازة</h2>
                                <p>يقع الفندق  فى وسط مدينة بيروت على بعد 50 متر من شارع الحمرا الشهير ,الفندق رائع من حيث الموقع فهو قريب من اماكن التسوق, مركز بيروت للفن و على بعد 10 دقائق من مطار رفيق الحريرى  ,ويضم جمنازيوم مجهز تجهيزا جيدا، وساونا ومكتب الاستقبال يعمل على مدار 24 ساعة. كما يمكن للنزلاء الاستمتاع بالمأكولات اللبنانية الشهيرة في مطعم الفندق أو اكتشاف العديد من خيارات الطعام النموذجية ذات المستوى العالمي، على بعد خطوات من الفندق يقع الفندق  </p>
                            </div>
                        </div>
                    </div>
                </div>
                <AgencyFooter />
            </div>
        );
    }
}

export default Services;
